<a href="https://colab.research.google.com/github/Dhanishsekar/imarticus-21-05-2002-/blob/main/Monthwise(DHANISH_S).ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

Part II: Time Series

In [2]:
from google.colab import drive
drive.mount("/content/drive")

Mounted at /content/drive

In [4]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
df=pd.read_csv("/content/drive/MyDrive/test/MonthWiseMarketArrivals_Clean.csv")
df.head()

,market,month,year,quantity,priceMin,priceMax,priceMod,state,city,date
0,ABOHAR(PB),January,2005,2350,404,493,446,PB,ABOHAR,January-2005
1,ABOHAR(PB),January,2006,900,487,638,563,PB,ABOHAR,January-2006
2,ABOHAR(PB),January,2010,790,1283,1592,1460,PB,ABOHAR,January-2010
3,ABOHAR(PB),January,2011,245,3067,3750,3433,PB,ABOHAR,January-2011
4,ABOHAR(PB),January,2012,1035,523,686,605,PB,ABOHAR,January-2012

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10227 entries, 0 to 10226
Data columns (total 10 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   market    10227 non-null  object
 1   month     10227 non-null  object
 2   year      10227 non-null  int64
 3   quantity  10227 non-null  int64
 4   priceMin  10227 non-null  int64
 5   priceMax  10227 non-null  int64
 6   priceMod  10227 non-null  int64
 7   state     10227 non-null  object
 8   city      10227 non-null  object
 9   date      10227 non-null  object
dtypes: int64(5), object(5)
memory usage: 799.1+ KB

In [6]:
df1=df.loc[df.city=="MUMBAI"]
df1

,market,month,year,quantity,priceMin,priceMax,priceMod,state,city,date
6654,MUMBAI,January,2004,267100,719,971,849,MS,MUMBAI,January-2004
6655,MUMBAI,January,2005,275845,261,513,387,MS,MUMBAI,January-2005
6656,MUMBAI,January,2006,228000,315,488,402,MS,MUMBAI,January-2006
6657,MUMBAI,January,2007,205200,866,1136,997,MS,MUMBAI,January-2007
6658,MUMBAI,January,2008,267550,348,550,448,MS,MUMBAI,January-2008
...,...,...,...,...,...,...,...,...,...,...
6795,MUMBAI,December,2011,290350,519,994,749,MS,MUMBAI,December-2011
6796,MUMBAI,December,2012,218500,1048,1609,1330,MS,MUMBAI,December-2012
6797,MUMBAI,December,2013,226385,1298,1976,1639,MS,MUMBAI,December-2013
6798,MUMBAI,December,2014,294150,1433,2178,1802,MS,MUMBAI,December-2014
6799,MUMBAI,December,2015,302409,1027,1877,1542,MS,MUMBAI,December-2015

In [7]:
df2=df1.drop(["month","year","quantity","priceMin","priceMax","state","city"],axis=1)
df2

      market  priceMod           date
6654  MUMBAI       849   January-2004
6655  MUMBAI       387   January-2005
6656  MUMBAI       402   January-2006
6657  MUMBAI       997   January-2007
6658  MUMBAI       448   January-2008
...      ...       ...            ...
6795  MUMBAI       749  December-2011
6796  MUMBAI      1330  December-2012
6797  MUMBAI      1639  December-2013
6798  MUMBAI      1802  December-2014
6799  MUMBAI      1542  December-2015

[146 rows x 3 columns]

In [8]:
df1.index=pd.PeriodIndex(df1.date,freq='M')
df1

,market,month,year,quantity,priceMin,priceMax,priceMod,state,city,date
date,,,,,,,,,,
2004-01,MUMBAI,January,2004,267100,719,971,849,MS,MUMBAI,January-2004
2005-01,MUMBAI,January,2005,275845,261,513,387,MS,MUMBAI,January-2005
2006-01,MUMBAI,January,2006,228000,315,488,402,MS,MUMBAI,January-2006
2007-01,MUMBAI,January,2007,205200,866,1136,997,MS,MUMBAI,January-2007
2008-01,MUMBAI,January,2008,267550,348,550,448,MS,MUMBAI,January-2008
...,...,...,...,...,...,...,...,...,...,...
2011-12,MUMBAI,December,2011,290350,519,994,749,MS,MUMBAI,December-2011
2012-12,MUMBAI,December,2012,218500,1048,1609,1330,MS,MUMBAI,December-2012
2013-12,MUMBAI,December,2013,226385,1298,1976,1639,MS,MUMBAI,December-2013
2014-12,MUMBAI,December,2014,294150,1433,2178,1802,MS,MUMBAI,December-2014
2015-12,MUMBAI,December,2015,302409,1027,1877,1542,MS,MUMBAI,December-2015